[![imagenes/pythonista.png](imagenes/pythonista.png)](https://pythonista.io)

# Gestión de datos.

Este capítulo explorará diversos atributos y métodos de las series y los dataframes de *Pandas* que pueden ser útiles para la gestión de los datos que contienen.

In [1]:
import pandas as pd
import numpy as np

## El dataframe ilustrativo.

* El dataframe ```población``` describe un censo poblacional de animmales en diversas regiones geográficas.

In [2]:
poblacion = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar',
                                   'cerdo salvaje',
                                    'tapir',
                                    'venado',
                                    'ocelote',
                                    'puma'),
                         'Norte_I':(12,
                                   np.NAN,
                                    None,
                                    2,
                                    4,
                                    2,
                                    14,
                                    5
                                   ),
                          'Norte_II':(23,
                                    4,
                                    25,
                                    21,
                                    9,
                                    121,
                                    1,
                                    2
                                   ),
                         'Centro_I':(15,
                                    23,
                                    2,
                                    120,
                                    40,
                                    121,
                                    0,
                                    5),
                         'Sur_I':(28,
                                  46,
                                  14,
                                  156,
                                  79,
                                  12,
                                  2,
                                  np.NAN)}).set_index('Animal')

In [3]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

## El atributo ```values```.

El atributo ```values``` regresa un arreglo de ```numpy``` con los valores que contiene una serie o dataframe.

**Ejemplo:**

In [4]:
poblacion.values

array([[ 12.,  23.,  15.,  28.],
       [ nan,   4.,  23.,  46.],
       [ nan,  25.,   2.,  14.],
       [  2.,  21., 120., 156.],
       [  4.,   9.,  40.,  79.],
       [  2., 121., 121.,  12.],
       [ 14.,   1.,   0.,   2.],
       [  5.,   2.,   5.,  nan]])

## El método ```head()```.

Regresa los primeros ```n``` renglones de un objeto de Pandas.

```
<objeto de Pandas>.head(<n>)
```

En donde:

* ```<n>``` es el número de renglones que se desean ver. En caso de no definir ```<n>``` el método regresa los primeros 5 renglones.

**Ejemplos:**

*  La siguiente celda desplegará los primeros 5 renglones del dataframe ```poblacion```.

In [5]:
poblacion.head()

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0

*  La siguiente celda desplegará los primeros 3 renglones del dataframe ```poblacion```.

In [6]:
poblacion.head(3)

        Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo       12.0        23        15   28.0
coyote      NaN         4        23   46.0
jaguar      NaN        25         2   14.0

## El método ```tail()```.

Regresa los últimos ```n``` renglones de un objeto de *Pandas*.

```
<objeto de Pandas>.tail(<n>)
```

En donde:

* ```<n>``` es el número de renglones que se desean ver. En caso de no definir ```<n>``` el método regresa los primeros 5 renglones.

**Ejemplos:**

* La siguiente celda desplegará los últimos 5 renglones del dataframe ```poblacion```.

In [7]:
poblacion.tail()

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

* La siguiente celda desplegará los últimos 2 renglones del dataframe ```poblacion```.

In [8]:
poblacion.tail(2)

         Norte_I  Norte_II  Centro_I  Sur_I
Animal
ocelote     14.0         1         0    2.0
puma         5.0         2         5    NaN

## El método ```smallest()```.

Regresa un número indicado de ```n``` renglones con los valores más pequeños de una o varias columnas de un objeto de *Pandas*.

```
<objeto de Pandas>.nsmallest(<n>, columns=[<índice de columna 1>, <índice de columna 2>, ..., <índice de columna n>])
```

El criterio de ordenamiento se da a partir de la primera columna enumerada en ```columns``` en adelante.

**Ejemplos:**

* La siguiente celda regresará los 3 renglones que contienen los valores más pequeños en la columna ```'Norte-1'``` del dataframe ```poblacion```.

In [9]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [10]:
poblacion.nsmallest(3, columns='Norte_I')

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
cerdo salvaje      2.0        21       120  156.0
venado             2.0       121       121   12.0
tapir              4.0         9        40   79.0

* La siguiente celda regresará los 3 renglones que contienen los valores más pequeños en las columnas ```'Norte-1'``` y ```'Sur-1'``` del dataframe ```poblacion```.

In [11]:
poblacion.nsmallest(3, columns=['Norte_I', 'Sur_I'])

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
venado             2.0       121       121   12.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0

## El método ```nlargest()```.

Regresa un número indicado de ```n``` renglones con los valores más grandes de una o varias columnas de un objeto de *Pandas*.

```
<objeto de Pandas>.nlargest(<n>, columms=[<col 1>, <col 2>, ..., <col n>])
```

El criterio de ordenamiento se da a partir de la primera columna enumerada en ```columns``` en adelante.

**Ejemplos:**

* La siguiente celda regresará los 3 renglones que contienen los valores más grandes en la columna ```'Sur-1'``` del dataframe ```poblacion```.

In [12]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [13]:
poblacion.nlargest(3, columns='Sur_I')

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
coyote             NaN         4        23   46.0

* La siguiente celda regresará los 3 renglones que contienen los valores más grandes en la columna ```'Sur-1'``` y ```'Norte-1``` del dataframe ```poblacion```.

In [14]:
poblacion.nlargest(3, columns=['Sur_I', 'Norte_I'])

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
coyote             NaN         4        23   46.0

## El método ```isin()``` .

Regresa otro objeto con contenidos booleanos indicando si el elemento del  objeto original se encuentra dentro de un iterable dado como argumento.
```
<objeto de Pandas>.isin(<iterable>)
```

**Ejemplo:**

* La siguiente celda regresará un dataframe evaluando si cada elemento de ```poblacion``` tiene un valor entre ```20``` y ```30```.

In [15]:
poblacion.isin(range(20, 31))

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo             False      True     False   True
coyote           False     False      True  False
jaguar           False      True     False  False
cerdo salvaje    False      True     False  False
tapir            False     False     False  False
venado           False     False     False  False
ocelote          False     False     False  False
puma             False     False     False  False

* La siguiente celda creará al dataframe ```especies```.

In [16]:
especies = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar'),
                         'Norte_I':('estable',
                                   'amenazado',
                                'amenazado'),
                          'Norte_II':('estable',
                                    'estable',
                                    'extinto'),
                         'Centro_I':('estable',
                                    'amenazado',
                                    'extinto'),
                         'Sur_I':('amenazado',
                                  'extinto',
                                  'estable')}).set_index('Animal')

In [17]:
especies

          Norte_I Norte_II   Centro_I      Sur_I
Animal
lobo      estable  estable    estable  amenazado
coyote  amenazado  estable  amenazado    extinto
jaguar  amenazado  extinto    extinto    estable

* La siguiente celda regresará un dataframe evaluando si cada elemento de ```especies``` tiene un valor que sea  ```'amenazado'``` o ```'extinto'```.

In [18]:
especies.isin(['amenazado', 'extinto'])

        Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo      False     False     False   True
coyote     True     False      True   True
jaguar     True      True      True  False

## El método ```diff()```.

Calcula la diferencia entre un elemento previo en el eje indicado (```0``` para las columnas y ```1``` para los renglones).

```
<objeto de Pandas>.diff(axis=<eje>)
```

Donde:

* ```<eje>``` es el número de eje al que se aplicará el método.


El valor por defecto para ```axis``` es ```0```.

**Ejemplos:**

* Se utilizará el dataframe ```poblacion```.

In [24]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

* Se aplicará el método ```diff()``` en el eje ```0```.

In [25]:
poblacion.diff()

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo               NaN       NaN       NaN    NaN
coyote             NaN     -19.0       8.0   18.0
jaguar             NaN      21.0     -21.0  -32.0
cerdo salvaje      NaN      -4.0     118.0  142.0
tapir              2.0     -12.0     -80.0  -77.0
venado            -2.0     112.0      81.0  -67.0
ocelote           12.0    -120.0    -121.0  -10.0
puma              -9.0       1.0       5.0    NaN

* Se aplicará el método ```diff()``` en el eje ```1```.

In [27]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [26]:
poblacion.diff(axis=1)

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo               NaN      11.0        -8   13.0
coyote             NaN       NaN        19   23.0
jaguar             NaN       NaN       -23   12.0
cerdo salvaje      NaN      19.0        99   36.0
tapir              NaN       5.0        31   39.0
venado             NaN     119.0         0 -109.0
ocelote            NaN     -13.0        -1    2.0
puma               NaN      -3.0         3    NaN

## El método  ```eval()```.

Ese método evalúa expresiones con operadores que se ingresan como cadenas de caracteres y que implican a las columnas de un dataframe.

```
<dataframe>.eval('<expresion>', inplace=<booleano>)
```

Donde:

* ```<expresión>``` es una cadena de caracteres que describe una expresión que incluye a dos o más identificadores de las columna y operadores.
* ```<booleano>``` es un valor que puede ser ```True``` o  ```False```.

El resultado es una serie.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.eval.html

### Expresiones con ```eval()```.

```
"<columna 1> <operador 1> <columna 2>" ...   
```

**Ejemplos:**

* Se realizará la operación de adición renglón por renglón de la columna ```'Norte_1'``` a la ```'Norte_2'```.

In [28]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

In [30]:
poblacion.eval("Norte_I + Norte_II")

Animal
lobo              35.0
coyote             NaN
jaguar             NaN
cerdo salvaje     23.0
tapir             13.0
venado           123.0
ocelote           15.0
puma               7.0
dtype: float64

* El dataframe ```poblacion_erronea``` incluye índices de columnas que impiden usar el método ```eval()``` debido a que las cadenas contienen al caracter ```-```, el cual puede ser interpretado como un operador.

In [31]:
poblacion_erronea = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar',
                                   'cerdo salvaje',
                                    'tapir',
                                    'venado',
                                    'ocelote',
                                    'puma'),
                         'Norte-I':(12,
                                   np.NAN,
                                    None,
                                    2,
                                    4,
                                    2,
                                    14,
                                    5
                                   ),
                          'Norte-II':(23,
                                    4,
                                    25,
                                    21,
                                    9,
                                    121,
                                    1,
                                    2
                                   ),
                         'Centro-I':(15,
                                    23,
                                    2,
                                    120,
                                    40,
                                    121,
                                    0,
                                    5),
                         'Sur-I':(28,
                                  46,
                                  14,
                                  156,
                                  79,
                                  12,
                                  2,
                                  np.NAN)}).set_index('Animal')

In [32]:
poblacion_erronea

               Norte-I  Norte-II  Centro-I  Sur-I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

* La siguiente celda generará un error de tipo ```KeyError```.

In [33]:
poblacion_erronea.eval("Norte-I + Norte-II")

UndefinedVariableError: name 'Norte' is not defined

### Creación de una nueva columna con ```eval()```.

Si la expresión definida en eval incluye un operador de asignación ```=```, el resultado se guardará en la columna a la que se le asigna el resultado de la operación.

**Ejemplo:**

* Se creará la columna ```'Norte'``` a partir de la operación de suma de ```'Norte_1'``` y ```'Norte_2'```.

In [34]:
poblacion.eval("Norte = Norte_I + Norte_II")

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [35]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I
Animal
lobo              12.0        23        15   28.0
coyote             NaN         4        23   46.0
jaguar             NaN        25         2   14.0
cerdo salvaje      2.0        21       120  156.0
tapir              4.0         9        40   79.0
venado             2.0       121       121   12.0
ocelote           14.0         1         0    2.0
puma               5.0         2         5    NaN

### El parámetro ```inplace```.

Este parámetro con valor ```True``` indica que en lugar de regresar un  nuevo dataframe, las operaciones se reflejan en el dataframe original.

El valor por defecto de ```inplace```es ```False```.

In [36]:
poblacion.eval("Norte = Norte_I + Norte_II", inplace=True)

In [37]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

## El método ```assign()```.

Crea una o mas columnas que contendrán los datos resultantes de una función específica.

```
<dataframe>.assign(<columna 1>=<función 1>, <columna 2>=<función2>, .. <columna 2>=<función2>)
```
Donde:

* ```<columna n>``` es el nombre de la nueva columna del dataframe.
* ```<función n>``` es una función capaz de regresar una serie con el mismo número de índices que el dataframe de origen.

El dataframe que contiene al método ```assign()``` es usado como argumento para las funciones.

**Ejemplos:**

* La siguiente celda regresará un dataframe creado a partir de ```poblacion``` al que se le añadirá la columna ```'Sureste'```, la cual es el resultado de la operación de suma de las columna ```poblacion['Sur_I']``` y ```poblacion['Centro_I']```.

In [38]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [39]:
poblacion.assign(Sureste=poblacion['Sur_I'] + poblacion['Centro_I'])

               Norte_I  Norte_II  Centro_I  Sur_I  Norte  Sureste
Animal
lobo              12.0        23        15   28.0   35.0     43.0
coyote             NaN         4        23   46.0    NaN     69.0
jaguar             NaN        25         2   14.0    NaN     16.0
cerdo salvaje      2.0        21       120  156.0   23.0    276.0
tapir              4.0         9        40   79.0   13.0    119.0
venado             2.0       121       121   12.0  123.0    133.0
ocelote           14.0         1         0    2.0   15.0      2.0
puma               5.0         2         5    NaN    7.0      NaN

* La siguiente celda regresará un dataframe creado a partir de ```poblacion``` al que se le añadirá la columna ```'Sur medio'```, la cual es el resultado de aplicar una función que multiplicar las columna ```['Sur_I']``` del dataframe que se le ingrese como argumento por ```0.5```.

In [40]:
poblacion.assign(Sur_medio=lambda x: x['Sur_I'] * 0.5)

               Norte_I  Norte_II  Centro_I  Sur_I  Norte  Sur_medio
Animal
lobo              12.0        23        15   28.0   35.0       14.0
coyote             NaN         4        23   46.0    NaN       23.0
jaguar             NaN        25         2   14.0    NaN        7.0
cerdo salvaje      2.0        21       120  156.0   23.0       78.0
tapir              4.0         9        40   79.0   13.0       39.5
venado             2.0       121       121   12.0  123.0        6.0
ocelote           14.0         1         0    2.0   15.0        1.0
puma               5.0         2         5    NaN    7.0        NaN

* La siguiente celda defina a la función ```mitad()``` la cual regresa el resultadoi de multiplicar las columna ```['Sur_I']``` del dataframe que se le ingrese como argumento por ```0.5```.

In [41]:
def mitad(x):
    return x['Sur_I'] * 0.5

* La siguiente celda regresará un dataframe creado a partir de ```poblacion``` al que se le añadirá la columna ```'Sur medio'```, la cual es el resultado de aplicar la función ```mitad```.

In [42]:
poblacion.assign(Sur_medio=mitad)

               Norte_I  Norte_II  Centro_I  Sur_I  Norte  Sur_medio
Animal
lobo              12.0        23        15   28.0   35.0       14.0
coyote             NaN         4        23   46.0    NaN       23.0
jaguar             NaN        25         2   14.0    NaN        7.0
cerdo salvaje      2.0        21       120  156.0   23.0       78.0
tapir              4.0         9        40   79.0   13.0       39.5
venado             2.0       121       121   12.0  123.0        6.0
ocelote           14.0         1         0    2.0   15.0        1.0
puma               5.0         2         5    NaN    7.0        NaN

* La siguiente celda regresará un dataframe creado a partir de ```poblacion``` al que se le añadirá la columna ```'Promedio'```, la cual es el resultado de aplicar una función que aplicará el método ```pd.DataFrame.mean``` en el eje ```1``` al dataframe que se ingrese como argumento.

In [43]:
poblacion.assign(Promedio=lambda x: pd.DataFrame.mean(x, axis=1))

               Norte_I  Norte_II  Centro_I  Sur_I  Norte   Promedio
Animal
lobo              12.0        23        15   28.0   35.0  22.600000
coyote             NaN         4        23   46.0    NaN  24.333333
jaguar             NaN        25         2   14.0    NaN  13.666667
cerdo salvaje      2.0        21       120  156.0   23.0  64.400000
tapir              4.0         9        40   79.0   13.0  29.000000
venado             2.0       121       121   12.0  123.0  75.800000
ocelote           14.0         1         0    2.0   15.0   6.400000
puma               5.0         2         5    NaN    7.0   4.750000

* La siguiente celda regresará un dataframe creado a partir de ```poblacion``` al que:
    * Se le añadirá la columna ```'Promedio'```, la cual es el resultado de aplicar una función que aplicará el método ```pd.DataFrame.mean``` en el eje ```1``` al dataframe que se ingrese como argumento.
    * Se le añadirá la columna ```'Suma'```, la cual es el resultado de aplicar una función que aplicará el método ```pd.DataFrame.sum``` en el eje ```1``` al dataframe que se ingrese como argumento restando la columna ```Promedio```.

In [44]:
poblacion.assign(Promedio=lambda x: pd.DataFrame.mean(x, axis=1),
                Suma=lambda x: pd.DataFrame.sum(x, axis=1) - x['Promedio'])

               Norte_I  Norte_II  Centro_I  Sur_I  Norte   Promedio   Suma
Animal
lobo              12.0        23        15   28.0   35.0  22.600000  113.0
coyote             NaN         4        23   46.0    NaN  24.333333   73.0
jaguar             NaN        25         2   14.0    NaN  13.666667   41.0
cerdo salvaje      2.0        21       120  156.0   23.0  64.400000  322.0
tapir              4.0         9        40   79.0   13.0  29.000000  145.0
venado             2.0       121       121   12.0  123.0  75.800000  379.0
ocelote           14.0         1         0    2.0   15.0   6.400000   32.0
puma               5.0         2         5    NaN    7.0   4.750000   19.0

## El método ```take()```.

 Este método regresa los renglones que se indiquen en función de un índice numérico.
 
 
 ```
 <objeto de Pandas>.take(<colección de índices numéricos>)
 ```

**Ejemplos:**

* La siguiente celda regresará los renglones con índice ```1```  y ```4``` del dataframe ```población```.

In [46]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [45]:
poblacion.take([1, 4])

        Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
coyote      NaN         4        23   46.0    NaN
tapir       4.0         9        40   79.0   13.0

* La siguiente celda regresará los renglones con índices del ```2``` a antes del ```7```en incrementos de ```2``` del dataframe ```poblacion```.

In [47]:
poblacion.take(range(2, 7, 2))

         Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
jaguar       NaN        25         2   14.0    NaN
tapir        4.0         9        40   79.0   13.0
ocelote     14.0         1         0    2.0   15.0

In [48]:
poblacion.take((2, 7, 2))

        Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
jaguar      NaN        25         2   14.0    NaN
puma        5.0         2         5    NaN    7.0
jaguar      NaN        25         2   14.0    NaN

## El método ```replace()```.

Este método sustituye un valor a que coincida con uno de los valores dados en una colección dada como argumento.

 ```
 <objeto de Pandas>.replace(<colección de valores>, <valor de sustitución>)
 ```

**Ejemplos:**

* La siguiente celda sustituirá al valor ```NaN``` por ```0``` en ```poblacion```.

In [49]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [50]:
poblacion.replace(np.NaN, 0)

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             0.0         4        23   46.0    0.0
jaguar             0.0        25         2   14.0    0.0
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    0.0    7.0

* La siguiente celda sustituirá a los valore ```NaN``` y ```0``` por ```'extinto'``` en ```poblacion```.

In [51]:
poblacion.replace([0, np.NaN], 'extinto')

               Norte_I Norte_II Centro_I    Sur_I    Norte
Animal
lobo              12.0       23       15     28.0     35.0
coyote         extinto        4       23     46.0  extinto
jaguar         extinto       25        2     14.0  extinto
cerdo salvaje      2.0       21      120    156.0     23.0
tapir              4.0        9       40     79.0     13.0
venado             2.0      121      121     12.0    123.0
ocelote           14.0        1  extinto      2.0     15.0
puma               5.0        2        5  extinto      7.0

## El método ```update()```.

Este método sustituirá los renglones del dataframe que contiene a dicho método con los datos de los renglones del dataframe que se ingresa como argumento exclusivamente en los índices que coincidan.

```
    <dataframe 1>.update(<dataframe 2>)
```

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.update.html

**Ejemplo:**

* Se utilizará el dataframe ```especies```.

In [52]:
especies = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar'),
                         'Norte_I':('estable',
                                   'amenazado',
                                'amenazado'),
                          'Norte_II':('estable',
                                    'estable',
                                    'extinto'),
                         'Centro_I':('estable',
                                    'amenazado',
                                    'extinto'),
                         'Sur_I':('amenazado',
                                  'extinto',
                                  'estable')}).set_index('Animal')

In [53]:
especies

          Norte_I Norte_II   Centro_I      Sur_I
Animal
lobo      estable  estable    estable  amenazado
coyote  amenazado  estable  amenazado    extinto
jaguar  amenazado  extinto    extinto    estable

* Se creará al dataframe ```otras_especies``` el cual comparte con ```especies``` el índice ```'lobo'```.

In [54]:
otras_especies = pd.DataFrame({'Animal':('lobo',
                                   'antilope',
                                   'tucán'),
                         'Norte_I':('estable',
                                   'estable',
                                   'estable'),
                          'Norte_II':('extinto',
                                    'estable',
                                    'estable'),
                         'Centro_I':('estable',
                                    'estable',
                                    'estable'),
                         'Sureste':('estable',
                                  'estable',
                                  'estable')}).set_index('Animal')

In [55]:
otras_especies

          Norte_I Norte_II Centro_I  Sureste
Animal
lobo      estable  extinto  estable  estable
antilope  estable  estable  estable  estable
tucán     estable  estable  estable  estable

* La suguiente celda sustituirá los valores del renglón con índice ```lobo``` del dataframe ```especies``` con los valores del  ```otras_especies```

In [56]:
especies.update(otras_especies)

In [57]:
especies

          Norte_I Norte_II   Centro_I      Sur_I
Animal
lobo      estable  extinto    estable  amenazado
coyote  amenazado  estable  amenazado    extinto
jaguar  amenazado  extinto    extinto    estable

## El metodo ```all()```.

Ese método se aplica para validar si todos los elementos de una columna (*axis=0*) o renglón (*axis=1*) son *True*.

```
<objeto>.all(axis=<n>)
```

In [65]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [66]:
poblacion > 0

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              True      True      True   True   True
coyote           False      True      True   True  False
jaguar           False      True      True   True  False
cerdo salvaje     True      True      True   True   True
tapir             True      True      True   True   True
venado            True      True      True   True   True
ocelote           True      True     False   True   True
puma              True      True      True  False   True

In [67]:
(poblacion > 0).all()

Norte_I     False
Norte_II     True
Centro_I    False
Sur_I       False
Norte       False
dtype: bool

In [68]:
(poblacion > 0).all(axis=1)

Animal
lobo              True
coyote           False
jaguar           False
cerdo salvaje     True
tapir             True
venado            True
ocelote          False
puma             False
dtype: bool

* Python toma como *True* a cualquier valor distinto de ```0```, ```None```o ```""```.

In [69]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [70]:
poblacion.all()

Norte_I      True
Norte_II     True
Centro_I    False
Sur_I        True
Norte        True
dtype: bool

## El método ```any()```.

Ese método se aplica para validar si al menos un elemento de una columna (*axis=0*) o renglón (*axis-1*) es *True*.

```
<objeto>.any(axis=<n>)
```

In [71]:
(poblacion > 0).any()

Norte_I     True
Norte_II    True
Centro_I    True
Sur_I       True
Norte       True
dtype: bool

In [72]:
(poblacion > 0).any(axis=1)

Animal
lobo             True
coyote           True
jaguar           True
cerdo salvaje    True
tapir            True
venado           True
ocelote          True
puma             True
dtype: bool

## El método ```items()```.

Este método crea un generador, el cual regresa tuplas de 2 elementos a partir de un  objeto de Pandas.

### El método ```items()``` en dataframes.
* En el caso de un dataframe, el generador regresa tuplas compuestas por los datos de cada columna con la siguiente estructura:

```
('<identificador de encabezado>', <objeto tipo pd.Series>)
```

### El método ```items()``` en series.
* En el caso de una serie, el generador regresa tuplas con la siguiente estructura:

```
('<identificador de índice>', <valor>)
```

In [74]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [73]:
poblacion.items()

In [75]:
for item in poblacion.items():
    print(item[0])
    print("--------------")
    print(item[1])

Norte_I
--------------
Animal
lobo             12.0
coyote            NaN
jaguar            NaN
cerdo salvaje     2.0
tapir             4.0
venado            2.0
ocelote          14.0
puma              5.0
Name: Norte_I, dtype: float64
Norte_II
--------------
Animal
lobo              23
coyote             4
jaguar            25
cerdo salvaje     21
tapir              9
venado           121
ocelote            1
puma               2
Name: Norte_II, dtype: int64
Centro_I
--------------
Animal
lobo              15
coyote            23
jaguar             2
cerdo salvaje    120
tapir             40
venado           121
ocelote            0
puma               5
Name: Centro_I, dtype: int64
Sur_I
--------------
Animal
lobo              28.0
coyote            46.0
jaguar            14.0
cerdo salvaje    156.0
tapir             79.0
venado            12.0
ocelote            2.0
puma               NaN
Name: Sur_I, dtype: float64
Norte
--------------
Animal
lobo              35.0
coyote             NaN
jaguar             NaN
cerdo salvaje     23.0
tapir             13.0
venado           123.0
ocelote           15.0
puma               7.0
Name: Norte, dtype: float64

In [76]:
for i in poblacion.items():
    print(i[0])
    print("--------")
    for j in i[1].items():
        print(j)

Norte_I
--------
('lobo', 12.0)
('coyote', nan)
('jaguar', nan)
('cerdo salvaje', 2.0)
('tapir', 4.0)
('venado', 2.0)
('ocelote', 14.0)
('puma', 5.0)
Norte_II
--------
('lobo', 23)
('coyote', 4)
('jaguar', 25)
('cerdo salvaje', 21)
('tapir', 9)
('venado', 121)
('ocelote', 1)
('puma', 2)
Centro_I
--------
('lobo', 15)
('coyote', 23)
('jaguar', 2)
('cerdo salvaje', 120)
('tapir', 40)
('venado', 121)
('ocelote', 0)
('puma', 5)
Sur_I
--------
('lobo', 28.0)
('coyote', 46.0)
('jaguar', 14.0)
('cerdo salvaje', 156.0)
('tapir', 79.0)
('venado', 12.0)
('ocelote', 2.0)
('puma', nan)
Norte
--------
('lobo', 35.0)
('coyote', nan)
('jaguar', nan)
('cerdo salvaje', 23.0)
('tapir', 13.0)
('venado', 123.0)
('ocelote', 15.0)
('puma', 7.0)

## El método ```drop()```.

Elimina los identficadores de los índices (*axis=0*) o columnas (*axis=1*) localizados dentro de una colección ingresada como argumento.
```
<objeto de Pandas>.drop(<colección de identificadores>, axis=<n>)
```

In [77]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [78]:
poblacion.drop(['Centro_I'], axis=1)

               Norte_I  Norte_II  Sur_I  Norte
Animal
lobo              12.0        23   28.0   35.0
coyote             NaN         4   46.0    NaN
jaguar             NaN        25   14.0    NaN
cerdo salvaje      2.0        21  156.0   23.0
tapir              4.0         9   79.0   13.0
venado             2.0       121   12.0  123.0
ocelote           14.0         1    2.0   15.0
puma               5.0         2    NaN    7.0

In [79]:
poblacion.drop(['lobo', 'tapir'])

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

## El método ```combine()```.

Este método combina dos dataframes e incluye una función la cual permitre decidir cual valor es que se respeta.

```
<dataframe 1>.combine(<dataframe 2>, <funcion>)
```

Donde:

* ```<funcion>``` es una función que comparará renglón por renglón ambos dataframes. 

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.combine.html

In [80]:
def menor( rebanada_1, rebanada_2):
    if (rebanada_1 == np.NAN).any():
        return rebanada_2
    if (rebanada_2 == np.NAN).any():
        return rebanada_1
    if rebanada_2.sum() > rebanada_1.sum():
        return rebanada_2
    else:
        return rebanada_1

In [81]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [82]:
otra_poblacion = pd.DataFrame({'Animal':('lobo',
                                   'coyote',
                                   'jaguar',
                                   'colibrí',
                                    'conejo'),
                         'Norte_I':(32,
                                   13,
                                    56,
                                    12,
                                    41,
                                   ),
                         'Sureste':(28,
                                  46,
                                  14,
                                  156,
                                  79,)}).set_index('Animal')

In [83]:
otra_poblacion

         Norte_I  Sureste
Animal
lobo          32       28
coyote        13       46
jaguar        56       14
colibrí       12      156
conejo        41       79

In [84]:
poblacion.combine(otra_poblacion, menor)

               Centro_I  Norte  Norte_I  Norte_II  Sur_I  Sureste
Animal
cerdo salvaje     120.0   23.0      NaN      21.0  156.0      NaN
colibrí             NaN    NaN     12.0       NaN    NaN    156.0
conejo              NaN    NaN     41.0       NaN    NaN     79.0
coyote             23.0    NaN     13.0       4.0   46.0     46.0
jaguar              2.0    NaN     56.0      25.0   14.0     14.0
lobo               15.0   35.0     32.0      23.0   28.0     28.0
ocelote             0.0   15.0      NaN       1.0    2.0      NaN
puma                5.0    7.0      NaN       2.0    NaN      NaN
tapir              40.0   13.0      NaN       9.0   79.0      NaN
venado            121.0  123.0      NaN     121.0   12.0      NaN

In [85]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [4, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})

In [86]:
df1

   A  B
0  0  4
1  0  4

In [87]:
df2

   A  B
0  1  3
1  1  3

In [88]:
take_smaller = lambda s1, s2: s1 if s1.sum() < s2.sum() else s2

In [89]:
df1.combine(df2, take_smaller)

   A  B
0  0  3
1  0  3

## El método ```insert()```.

Este método insertará una columna en la posición que se le indique.

```
<objeto de Pandas>.insert(<posición numérica>, <nombre de columna>, <valores>)
```

In [90]:
poblacion

               Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo              12.0        23        15   28.0   35.0
coyote             NaN         4        23   46.0    NaN
jaguar             NaN        25         2   14.0    NaN
cerdo salvaje      2.0        21       120  156.0   23.0
tapir              4.0         9        40   79.0   13.0
venado             2.0       121       121   12.0  123.0
ocelote           14.0         1         0    2.0   15.0
puma               5.0         2         5    NaN    7.0

In [91]:
poblacion.insert(0, 'Sur', [7, 21, 23, 6, 11, 32, 21, 1])

In [92]:
poblacion

               Sur  Norte_I  Norte_II  Centro_I  Sur_I  Norte
Animal
lobo             7     12.0        23        15   28.0   35.0
coyote          21      NaN         4        23   46.0    NaN
jaguar          23      NaN        25         2   14.0    NaN
cerdo salvaje    6      2.0        21       120  156.0   23.0
tapir           11      4.0         9        40   79.0   13.0
venado          32      2.0       121       121   12.0  123.0
ocelote         21     14.0         1         0    2.0   15.0
puma             1      5.0         2         5    NaN    7.0

<p style="text-align: center"><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/80x15.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional</a>.</p>
<p style="text-align: center">&copy; José Luis Chiquete Valdivieso. 2019.</p>